Blueprint-Foundry/Shelly/Software/ESP32_Sketchpad/TOF Development/ESP32_SPAD_Attempt1/ESP32_Wrover_TOF2_debug3/vl53l1_register_map.h
	fields: \n
		-   [0] = clk_gate_en__go1_mcu_bank
		-   [1] = clk_gate_en__go1_mcu_patch_ctrl
		-   [2] = clk_gate_en__go1_mcu_timers
		-   [3] = clk_gate_en__go1_mcu_mult_div
*/
#define VL53L1_TEST__BIST_ROM_CTRL                                                       0x04E0
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_TEST__BIST_ROM_RESULT                                                     0x04E1
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_TEST__BIST_ROM_MCU_SIG                                                    0x04E2
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_TEST__BIST_ROM_MCU_SIG_HI                                                 0x04E2
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_TEST__BIST_ROM_MCU_SIG_LO                                                 0x04E3
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_TEST__BIST_RAM_CTRL                                                       0x04E4
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_TEST__BIST_RAM_RESULT                                                     0x04E5
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_TEST__TMC                                                                 0x04E8
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_TEST__PLL_BIST_MIN_THRESHOLD                                              0x04F0
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_TEST__PLL_BIST_MIN_THRESHOLD_HI                                           0x04F0
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_TEST__PLL_BIST_MIN_THRESHOLD_LO                                           0x04F1
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_TEST__PLL_BIST_MAX_THRESHOLD                                              0x04F2
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_TEST__PLL_BIST_MAX_THRESHOLD_HI                                           0x04F2
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_TEST__PLL_BIST_MAX_THRESHOLD_LO                                           0x04F3
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_TEST__PLL_BIST_COUNT_OUT                                                  0x04F4
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_TEST__PLL_BIST_COUNT_OUT_HI                                               0x04F4
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_TEST__PLL_BIST_COUNT_OUT_LO                                               0x04F5
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_TEST__PLL_BIST_GONOGO                                                     0x04F6
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_TEST__PLL_BIST_CTRL                                                       0x04F7
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__DEVICE_ID                                                   0x0680
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__REVISION_ID                                                 0x0681
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__CLK_CTRL1                                                   0x0683
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__CLK_CTRL2                                                   0x0684
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__WOI_1                                                       0x0685
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__WOI_REF_1                                                   0x0686
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__START_RANGING                                               0x0687
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__LOW_LIMIT_1                                                 0x0690
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__HIGH_LIMIT_1                                                0x0691
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__LOW_LIMIT_REF_1                                             0x0692
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__HIGH_LIMIT_REF_1                                            0x0693
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__QUANTIFIER_1_MSB                                            0x0694
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__QUANTIFIER_1_LSB                                            0x0695
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__QUANTIFIER_REF_1_MSB                                        0x0696
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__QUANTIFIER_REF_1_LSB                                        0x0697
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__AMBIENT_OFFSET_1_MSB                                        0x0698
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__AMBIENT_OFFSET_1_LSB                                        0x0699
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__AMBIENT_OFFSET_REF_1_MSB                                    0x069A
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__AMBIENT_OFFSET_REF_1_LSB                                    0x069B
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__FILTER_STRENGTH_1                                           0x069C
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__FILTER_STRENGTH_REF_1                                       0x069D
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__SIGNAL_EVENT_LIMIT_1_MSB                                    0x069E
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__SIGNAL_EVENT_LIMIT_1_LSB                                    0x069F
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__SIGNAL_EVENT_LIMIT_REF_1_MSB                                0x06A0
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__SIGNAL_EVENT_LIMIT_REF_1_LSB                                0x06A1
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__TIMEOUT_OVERALL_PERIODS_MSB                                 0x06A4
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__TIMEOUT_OVERALL_PERIODS_LSB                                 0x06A5
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__INVERT_HW                                                   0x06A6
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__FORCE_HW                                                    0x06A7
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__STATIC_HW_VALUE                                             0x06A8
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__FORCE_CONTINUOUS_AMBIENT                                    0x06A9
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__TEST_PHASE_SELECT_TO_FILTER                                 0x06AA
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__TEST_PHASE_SELECT_TO_TIMING_GEN                             0x06AB
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__INITIAL_PHASE_VALUE_1                                       0x06AC
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__INITIAL_PHASE_VALUE_REF_1                                   0x06AD
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__FORCE_UP_IN                                                 0x06AE
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__FORCE_DN_IN                                                 0x06AF
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__STATIC_UP_VALUE_1                                           0x06B0
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__STATIC_UP_VALUE_REF_1                                       0x06B1
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__STATIC_DN_VALUE_1                                           0x06B2
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__STATIC_DN_VALUE_REF_1                                       0x06B3
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__MONITOR_UP_DN                                               0x06B4
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__INVERT_UP_DN                                                0x06B5
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__CPUMP_1                                                     0x06B6
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__CPUMP_2                                                     0x06B7
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__CPUMP_3                                                     0x06B8
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__OSC_1                                                       0x06B9
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__PLL_1                                                       0x06BB
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__PLL_2                                                       0x06BC
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__REFERENCE_1                                                 0x06BD
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__REFERENCE_3                                                 0x06BF
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__REFERENCE_4                                                 0x06C0
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__REFERENCE_5                                                 0x06C1
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__REGAVDD1V2                                                  0x06C3
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__CALIB_1                                                     0x06C4
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__CALIB_2                                                     0x06C5
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__CALIB_3                                                     0x06C6
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__TST_MUX_SEL1                                                0x06C9
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__TST_MUX_SEL2                                                0x06CA
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__TST_MUX                                                     0x06CB
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__GPIO_OUT_TESTMUX                                            0x06CC
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__CUSTOM_FE                                                   0x06CD
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__CUSTOM_FE_2                                                 0x06CE
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__SPAD_READOUT                                                0x06CF
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__SPAD_READOUT_1                                              0x06D0
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__SPAD_READOUT_2                                              0x06D1
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__SPAD_PS                                                     0x06D2
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__LASER_SAFETY_2                                              0x06D4
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__NVM_CTRL__MODE                                              0x0780
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__NVM_CTRL__PDN                                               0x0781
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__NVM_CTRL__PROGN                                             0x0782
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__NVM_CTRL__READN                                             0x0783
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__NVM_CTRL__PULSE_WIDTH_MSB                                   0x0784
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__NVM_CTRL__PULSE_WIDTH_LSB                                   0x0785
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__NVM_CTRL__HV_RISE_MSB                                       0x0786
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__NVM_CTRL__HV_RISE_LSB                                       0x0787
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__NVM_CTRL__HV_FALL_MSB                                       0x0788
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__NVM_CTRL__HV_FALL_LSB                                       0x0789
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__NVM_CTRL__TST                                               0x078A
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__NVM_CTRL__TESTREAD                                          0x078B
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__NVM_CTRL__DATAIN_MMM                                        0x078C
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__NVM_CTRL__DATAIN_LMM                                        0x078D
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__NVM_CTRL__DATAIN_LLM                                        0x078E
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__NVM_CTRL__DATAIN_LLL                                        0x078F
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__NVM_CTRL__DATAOUT_MMM                                       0x0790
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__NVM_CTRL__DATAOUT_LMM                                       0x0791
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__NVM_CTRL__DATAOUT_LLM                                       0x0792
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__NVM_CTRL__DATAOUT_LLL                                       0x0793
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__NVM_CTRL__ADDR                                              0x0794
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__NVM_CTRL__DATAOUT_ECC                                       0x0795
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__RET_SPAD_EN_0                                               0x0796
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__RET_SPAD_EN_1                                               0x0797
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__RET_SPAD_EN_2                                               0x0798
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__RET_SPAD_EN_3                                               0x0799
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__RET_SPAD_EN_4                                               0x079A
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__RET_SPAD_EN_5                                               0x079B
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__RET_SPAD_EN_6                                               0x079C
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__RET_SPAD_EN_7                                               0x079D
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__RET_SPAD_EN_8                                               0x079E
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__RET_SPAD_EN_9                                               0x079F
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__RET_SPAD_EN_10                                              0x07A0
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__RET_SPAD_EN_11                                              0x07A1
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__RET_SPAD_EN_12                                              0x07A2
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__RET_SPAD_EN_13                                              0x07A3
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__RET_SPAD_EN_14                                              0x07A4
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__RET_SPAD_EN_15                                              0x07A5
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__RET_SPAD_EN_16                                              0x07A6
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__RET_SPAD_EN_17                                              0x07A7
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__SPAD_SHIFT_EN                                               0x07BA
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__SPAD_DISABLE_CTRL                                           0x07BB
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__SPAD_EN_SHIFT_OUT_DEBUG                                     0x07BC
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__SPI_MODE                                                    0x07BD
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__GPIO_DIR                                                    0x07BE
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__VCSEL_PERIOD                                                0x0880
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__VCSEL_START                                                 0x0881
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__VCSEL_STOP                                                  0x0882
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__VCSEL_1                                                     0x0885
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__VCSEL_STATUS                                                0x088D
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__STATUS                                                      0x0980
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__LASER_CONTINUITY_STATE                                      0x0981
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__RANGE_1_MMM                                                 0x0982
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__RANGE_1_LMM                                                 0x0983
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__RANGE_1_LLM                                                 0x0984
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__RANGE_1_LLL                                                 0x0985
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__RANGE_REF_1_MMM                                             0x0986
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__RANGE_REF_1_LMM                                             0x0987
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__RANGE_REF_1_LLM                                             0x0988
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__RANGE_REF_1_LLL                                             0x0989
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__AMBIENT_WINDOW_EVENTS_1_MMM                                 0x098A
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__AMBIENT_WINDOW_EVENTS_1_LMM                                 0x098B
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__AMBIENT_WINDOW_EVENTS_1_LLM                                 0x098C
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGING_CORE__AMBIENT_WINDOW_EVENTS_1_LLL                                 0x098D
/*!<
	info: \n
