Blueprint-Foundry/Shelly/Software/ESP32_Sketchpad/TOF Development/ESP32_SPAD_Attempt1/ESP32_Wrover_TOF2_debug3/vl53l1_register_map.h
	fields: \n
		- [7:0] = dss_calc__user_roi_spad_en_1
*/
#define VL53L1_DSS_CALC__USER_ROI_SPAD_EN_2                                              0x0F5E
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['patch_results', 'dss_calc']

	fields: \n
		- [7:0] = dss_calc__user_roi_spad_en_2
*/
#define VL53L1_DSS_CALC__USER_ROI_SPAD_EN_3                                              0x0F5F
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['patch_results', 'dss_calc']

	fields: \n
		- [7:0] = dss_calc__user_roi_spad_en_3
*/
#define VL53L1_DSS_CALC__USER_ROI_SPAD_EN_4                                              0x0F60
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['patch_results', 'dss_calc']

	fields: \n
		- [7:0] = dss_calc__user_roi_spad_en_4
*/
#define VL53L1_DSS_CALC__USER_ROI_SPAD_EN_5                                              0x0F61
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['patch_results', 'dss_calc']

	fields: \n
		- [7:0] = dss_calc__user_roi_spad_en_5
*/
#define VL53L1_DSS_CALC__USER_ROI_SPAD_EN_6                                              0x0F62
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['patch_results', 'dss_calc']

	fields: \n
		- [7:0] = dss_calc__user_roi_spad_en_6
*/
#define VL53L1_DSS_CALC__USER_ROI_SPAD_EN_7                                              0x0F63
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['patch_results', 'dss_calc']

	fields: \n
		- [7:0] = dss_calc__user_roi_spad_en_7
*/
#define VL53L1_DSS_CALC__USER_ROI_SPAD_EN_8                                              0x0F64
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['patch_results', 'dss_calc']

	fields: \n
		- [7:0] = dss_calc__user_roi_spad_en_8
*/
#define VL53L1_DSS_CALC__USER_ROI_SPAD_EN_9                                              0x0F65
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['patch_results', 'dss_calc']

	fields: \n
		- [7:0] = dss_calc__user_roi_spad_en_9
*/
#define VL53L1_DSS_CALC__USER_ROI_SPAD_EN_10                                             0x0F66
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['patch_results', 'dss_calc']

	fields: \n
		- [7:0] = dss_calc__user_roi_spad_en_10
*/
#define VL53L1_DSS_CALC__USER_ROI_SPAD_EN_11                                             0x0F67
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['patch_results', 'dss_calc']

	fields: \n
		- [7:0] = dss_calc__user_roi_spad_en_11
*/
#define VL53L1_DSS_CALC__USER_ROI_SPAD_EN_12                                             0x0F68
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['patch_results', 'dss_calc']

	fields: \n
		- [7:0] = dss_calc__user_roi_spad_en_12
*/
#define VL53L1_DSS_CALC__USER_ROI_SPAD_EN_13                                             0x0F69
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['patch_results', 'dss_calc']

	fields: \n
		- [7:0] = dss_calc__user_roi_spad_en_13
*/
#define VL53L1_DSS_CALC__USER_ROI_SPAD_EN_14                                             0x0F6A
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['patch_results', 'dss_calc']

	fields: \n
		- [7:0] = dss_calc__user_roi_spad_en_14
*/
#define VL53L1_DSS_CALC__USER_ROI_SPAD_EN_15                                             0x0F6B
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['patch_results', 'dss_calc']

	fields: \n
		- [7:0] = dss_calc__user_roi_spad_en_15
*/
#define VL53L1_DSS_CALC__USER_ROI_SPAD_EN_16                                             0x0F6C
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['patch_results', 'dss_calc']

	fields: \n
		- [7:0] = dss_calc__user_roi_spad_en_16
*/
#define VL53L1_DSS_CALC__USER_ROI_SPAD_EN_17                                             0x0F6D
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['patch_results', 'dss_calc']

	fields: \n
		- [7:0] = dss_calc__user_roi_spad_en_17
*/
#define VL53L1_DSS_CALC__USER_ROI_SPAD_EN_18                                             0x0F6E
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['patch_results', 'dss_calc']

	fields: \n
		- [7:0] = dss_calc__user_roi_spad_en_18
*/
#define VL53L1_DSS_CALC__USER_ROI_SPAD_EN_19                                             0x0F6F
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['patch_results', 'dss_calc']

	fields: \n
		- [7:0] = dss_calc__user_roi_spad_en_19
*/
#define VL53L1_DSS_CALC__USER_ROI_SPAD_EN_20                                             0x0F70
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['patch_results', 'dss_calc']

	fields: \n
		- [7:0] = dss_calc__user_roi_spad_en_20
*/
#define VL53L1_DSS_CALC__USER_ROI_SPAD_EN_21                                             0x0F71
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['patch_results', 'dss_calc']

	fields: \n
		- [7:0] = dss_calc__user_roi_spad_en_21
*/
#define VL53L1_DSS_CALC__USER_ROI_SPAD_EN_22                                             0x0F72
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['patch_results', 'dss_calc']

	fields: \n
		- [7:0] = dss_calc__user_roi_spad_en_22
*/
#define VL53L1_DSS_CALC__USER_ROI_SPAD_EN_23                                             0x0F73
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['patch_results', 'dss_calc']

	fields: \n
		- [7:0] = dss_calc__user_roi_spad_en_23
*/
#define VL53L1_DSS_CALC__USER_ROI_SPAD_EN_24                                             0x0F74
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['patch_results', 'dss_calc']

	fields: \n
		- [7:0] = dss_calc__user_roi_spad_en_24
*/
#define VL53L1_DSS_CALC__USER_ROI_SPAD_EN_25                                             0x0F75
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['patch_results', 'dss_calc']

	fields: \n
		- [7:0] = dss_calc__user_roi_spad_en_25
*/
#define VL53L1_DSS_CALC__USER_ROI_SPAD_EN_26                                             0x0F76
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['patch_results', 'dss_calc']

	fields: \n
		- [7:0] = dss_calc__user_roi_spad_en_26
*/
#define VL53L1_DSS_CALC__USER_ROI_SPAD_EN_27                                             0x0F77
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['patch_results', 'dss_calc']

	fields: \n
		- [7:0] = dss_calc__user_roi_spad_en_27
*/
#define VL53L1_DSS_CALC__USER_ROI_SPAD_EN_28                                             0x0F78
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['patch_results', 'dss_calc']

	fields: \n
		- [7:0] = dss_calc__user_roi_spad_en_28
*/
#define VL53L1_DSS_CALC__USER_ROI_SPAD_EN_29                                             0x0F79
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['patch_results', 'dss_calc']

	fields: \n
		- [7:0] = dss_calc__user_roi_spad_en_29
*/
#define VL53L1_DSS_CALC__USER_ROI_SPAD_EN_30                                             0x0F7A
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['patch_results', 'dss_calc']

	fields: \n
		- [7:0] = dss_calc__user_roi_spad_en_30
*/
#define VL53L1_DSS_CALC__USER_ROI_SPAD_EN_31                                             0x0F7B
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['patch_results', 'dss_calc']

	fields: \n
		- [7:0] = dss_calc__user_roi_spad_en_31
*/
#define VL53L1_DSS_CALC__USER_ROI_0                                                      0x0F7C
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['patch_results', 'dss_calc']

	fields: \n
		- [7:0] = dss_calc__user_roi_0
*/
#define VL53L1_DSS_CALC__USER_ROI_1                                                      0x0F7D
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['patch_results', 'dss_calc']

	fields: \n
		- [7:0] = dss_calc__user_roi_1
*/
#define VL53L1_DSS_CALC__MODE_ROI_0                                                      0x0F7E
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['patch_results', 'dss_calc']

	fields: \n
		- [7:0] = dss_calc__mode_roi_0
*/
#define VL53L1_DSS_CALC__MODE_ROI_1                                                      0x0F7F
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['patch_results', 'dss_calc']

	fields: \n
		- [7:0] = dss_calc__mode_roi_1
*/
#define VL53L1_SIGMA_ESTIMATOR_CALC__SPARE_0                                             0x0F80
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['patch_results', 'sigma_est_spare']

	fields: \n
		- [7:0] = sigma_estimator_calc__spare_0
*/
#define VL53L1_VHV_RESULT__PEAK_SIGNAL_RATE_MCPS                                         0x0F82
/*!<
	type:     uint16_t \n
	default:  0x0000 \n
	info: \n
		- msb = 15
		- lsb =  0
		- i2c_size =  2

	groups: \n
		['patch_results', 'vhv_results']

	fields: \n
		- [15:0] = vhv_result__peak_signal_rate_mcps
*/
#define VL53L1_VHV_RESULT__PEAK_SIGNAL_RATE_MCPS_HI                                      0x0F82
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_VHV_RESULT__PEAK_SIGNAL_RATE_MCPS_LO                                      0x0F83
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_VHV_RESULT__SIGNAL_TOTAL_EVENTS_REF                                       0x0F84
/*!<
	type:     uint32_t \n
	default:  0x00000000 \n
	info: \n
		- msb = 31
		- lsb =  0
		- i2c_size =  4

	groups: \n
		['patch_results', 'vhv_results']

	fields: \n
		- [31:0] = vhv_result__signal_total_events_ref
*/
#define VL53L1_VHV_RESULT__SIGNAL_TOTAL_EVENTS_REF_3                                     0x0F84
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_VHV_RESULT__SIGNAL_TOTAL_EVENTS_REF_2                                     0x0F85
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_VHV_RESULT__SIGNAL_TOTAL_EVENTS_REF_1                                     0x0F86
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_VHV_RESULT__SIGNAL_TOTAL_EVENTS_REF_0                                     0x0F87
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_PHASECAL_RESULT__PHASE_OUTPUT_REF                                         0x0F88
/*!<
	type:     uint16_t \n
	default:  0x0000 \n
	info: \n
		- msb = 15
		- lsb =  0
		- i2c_size =  2

	groups: \n
		['patch_results', 'phasecal_results']

	fields: \n
		- [15:0] = phasecal_result__normalised_phase_ref
*/
#define VL53L1_PHASECAL_RESULT__PHASE_OUTPUT_REF_HI                                      0x0F88
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_PHASECAL_RESULT__PHASE_OUTPUT_REF_LO                                      0x0F89
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_DSS_RESULT__TOTAL_RATE_PER_SPAD                                           0x0F8A
/*!<
	type:     uint16_t \n
	default:  0x0000 \n
	info: \n
		- msb = 15
		- lsb =  0
		- i2c_size =  2

	groups: \n
		['patch_results', 'dss_results']

	fields: \n
		- [15:0] = dss_result__total_rate_per_spad
*/
#define VL53L1_DSS_RESULT__TOTAL_RATE_PER_SPAD_HI                                        0x0F8A
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_DSS_RESULT__TOTAL_RATE_PER_SPAD_LO                                        0x0F8B
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_DSS_RESULT__ENABLED_BLOCKS                                                0x0F8C
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['patch_results', 'dss_results']

	fields: \n
		- [7:0] = dss_result__enabled_blocks
*/
#define VL53L1_DSS_RESULT__NUM_REQUESTED_SPADS                                           0x0F8E
/*!<
	type:     uint16_t \n
	default:  0x0000 \n
	info: \n
		- msb = 15
		- lsb =  0
		- i2c_size =  2

	groups: \n
		['patch_results', 'dss_results']

	fields: \n
		- [15:0] = dss_result__num_requested_spads (fixed point 8.8)
*/
#define VL53L1_DSS_RESULT__NUM_REQUESTED_SPADS_HI                                        0x0F8E
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_DSS_RESULT__NUM_REQUESTED_SPADS_LO                                        0x0F8F
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_MM_RESULT__INNER_INTERSECTION_RATE                                        0x0F92
/*!<
	type:     uint16_t \n
	default:  0x0000 \n
	info: \n
		- msb = 15
		- lsb =  0
		- i2c_size =  2

	groups: \n
		['patch_results', 'mm_results']

	fields: \n
		- [15:0] = mm_result__inner_intersection_rate
*/
#define VL53L1_MM_RESULT__INNER_INTERSECTION_RATE_HI                                     0x0F92
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_MM_RESULT__INNER_INTERSECTION_RATE_LO                                     0x0F93
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_MM_RESULT__OUTER_COMPLEMENT_RATE                                          0x0F94
/*!<
	type:     uint16_t \n
	default:  0x0000 \n
	info: \n
		- msb = 15
		- lsb =  0
		- i2c_size =  2

	groups: \n
		['patch_results', 'mm_results']

	fields: \n
		- [15:0] = mm_result__outer_complement_rate
*/
#define VL53L1_MM_RESULT__OUTER_COMPLEMENT_RATE_HI                                       0x0F94
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_MM_RESULT__OUTER_COMPLEMENT_RATE_LO                                       0x0F95
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_MM_RESULT__TOTAL_OFFSET                                                   0x0F96
/*!<
	type:     uint16_t \n
	default:  0x0000 \n
	info: \n
		- msb = 15
		- lsb =  0
		- i2c_size =  2

	groups: \n
		['patch_results', 'mm_results']

	fields: \n
		- [15:0] = mm_result__total_offset
*/
#define VL53L1_MM_RESULT__TOTAL_OFFSET_HI                                                0x0F96
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_MM_RESULT__TOTAL_OFFSET_LO                                                0x0F97
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_XTALK_CALC__XTALK_FOR_ENABLED_SPADS                                       0x0F98
/*!<
	type:     uint32_t \n
	default:  0x00000000 \n
	info: \n
		- msb = 23
		- lsb =  0
		- i2c_size =  4

	groups: \n
		['patch_results', 'xtalk_calc']

	fields: \n
		- [23:0] = xtalk_calc__xtalk_for_enabled_spads (fixed point 11.13)
*/
#define VL53L1_XTALK_CALC__XTALK_FOR_ENABLED_SPADS_3                                     0x0F98
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_XTALK_CALC__XTALK_FOR_ENABLED_SPADS_2                                     0x0F99
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_XTALK_CALC__XTALK_FOR_ENABLED_SPADS_1                                     0x0F9A
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_XTALK_CALC__XTALK_FOR_ENABLED_SPADS_0                                     0x0F9B
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_XTALK_RESULT__AVG_XTALK_USER_ROI_KCPS                                     0x0F9C
/*!<
	type:     uint32_t \n
	default:  0x00000000 \n
	info: \n
		- msb = 23
		- lsb =  0
		- i2c_size =  4

	groups: \n
		['patch_results', 'xtalk_results']

	fields: \n
		- [23:0] = xtalk_result__avg_xtalk_user_roi_kcps (fixed point 11.13)
*/
#define VL53L1_XTALK_RESULT__AVG_XTALK_USER_ROI_KCPS_3                                   0x0F9C
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_XTALK_RESULT__AVG_XTALK_USER_ROI_KCPS_2                                   0x0F9D
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_XTALK_RESULT__AVG_XTALK_USER_ROI_KCPS_1                                   0x0F9E
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_XTALK_RESULT__AVG_XTALK_USER_ROI_KCPS_0                                   0x0F9F
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_XTALK_RESULT__AVG_XTALK_MM_INNER_ROI_KCPS                                 0x0FA0
/*!<
	type:     uint32_t \n
	default:  0x00000000 \n
	info: \n
		- msb = 23
		- lsb =  0
		- i2c_size =  4

	groups: \n
		['patch_results', 'xtalk_results']

	fields: \n
		- [23:0] = xtalk_result__avg_xtalk_mm_inner_roi_kcps (fixed point 11.13)
*/
#define VL53L1_XTALK_RESULT__AVG_XTALK_MM_INNER_ROI_KCPS_3                               0x0FA0
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_XTALK_RESULT__AVG_XTALK_MM_INNER_ROI_KCPS_2                               0x0FA1
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_XTALK_RESULT__AVG_XTALK_MM_INNER_ROI_KCPS_1                               0x0FA2
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_XTALK_RESULT__AVG_XTALK_MM_INNER_ROI_KCPS_0                               0x0FA3
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_XTALK_RESULT__AVG_XTALK_MM_OUTER_ROI_KCPS                                 0x0FA4
/*!<
	type:     uint32_t \n
	default:  0x00000000 \n
	info: \n
		- msb = 23
		- lsb =  0
		- i2c_size =  4

	groups: \n
		['patch_results', 'xtalk_results']

	fields: \n
		- [23:0] = xtalk_result__avg_xtalk_mm_outer_roi_kcps (fixed point 11.13)
*/
#define VL53L1_XTALK_RESULT__AVG_XTALK_MM_OUTER_ROI_KCPS_3                               0x0FA4
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_XTALK_RESULT__AVG_XTALK_MM_OUTER_ROI_KCPS_2                               0x0FA5
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_XTALK_RESULT__AVG_XTALK_MM_OUTER_ROI_KCPS_1                               0x0FA6
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_XTALK_RESULT__AVG_XTALK_MM_OUTER_ROI_KCPS_0                               0x0FA7
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGE_RESULT__ACCUM_PHASE                                                 0x0FA8
/*!<
	type:     uint32_t \n
	default:  0x00000000 \n
	info: \n
		- msb = 31
		- lsb =  0
		- i2c_size =  4

	groups: \n
		['patch_results', 'range_results']

	fields: \n
		- [31:0] = range_result__accum_phase
*/
#define VL53L1_RANGE_RESULT__ACCUM_PHASE_3                                               0x0FA8
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGE_RESULT__ACCUM_PHASE_2                                               0x0FA9
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGE_RESULT__ACCUM_PHASE_1                                               0x0FAA
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGE_RESULT__ACCUM_PHASE_0                                               0x0FAB
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGE_RESULT__OFFSET_CORRECTED_RANGE                                      0x0FAC
/*!<
	type:     uint16_t \n
	default:  0x0000 \n
	info: \n
		- msb = 15
		- lsb =  0
		- i2c_size =  2

	groups: \n
		['patch_results', 'range_results']

	fields: \n
		- [15:0] = range_result__offset_corrected_range
*/
#define VL53L1_RANGE_RESULT__OFFSET_CORRECTED_RANGE_HI                                   0x0FAC
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_RANGE_RESULT__OFFSET_CORRECTED_RANGE_LO                                   0x0FAD
/*!<
	info: \n
		- msb =  0
		- lsb =  0
		- i2c_size =  1
*/
#define VL53L1_SHADOW_PHASECAL_RESULT__VCSEL_START                                       0x0FAE
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['shadow_system_results', 'histogram_results']

	fields: \n
		- [7:0] = shadow_phasecal_result__vcsel_start
*/
#define VL53L1_SHADOW_RESULT__INTERRUPT_STATUS                                           0x0FB0
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  5
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['shadow_system_results', 'results']

	fields: \n
		- [2:0] = shadow_int_status
		- [4:3] = shadow_int_error_status
		-   [5] = shadow_gph_id_gpio_status
*/
#define VL53L1_SHADOW_RESULT__RANGE_STATUS                                               0x0FB1
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['shadow_system_results', 'results']

	fields: \n
		- [4:0] = shadow_range_status
		-   [5] = shadow_max_threshold_hit
		-   [6] = shadow_min_threshold_hit
		-   [7] = shadow_gph_id_range_status
*/
#define VL53L1_SHADOW_RESULT__REPORT_STATUS                                              0x0FB2
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  3
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['shadow_system_results', 'results']

	fields: \n
		- [3:0] = shadow_report_status
*/
#define VL53L1_SHADOW_RESULT__STREAM_COUNT                                               0x0FB3
/*!<
	type:     uint8_t \n
	default:  0x00 \n
	info: \n
		- msb =  7
		- lsb =  0
		- i2c_size =  1

	groups: \n
		['shadow_system_results', 'results']

	fields: \n
		- [7:0] = shadow_result__stream_count
*/
#define VL53L1_SHADOW_RESULT__DSS_ACTUAL_EFFECTIVE_SPADS_SD0                             0x0FB4
/*!<
	type:     uint16_t \n
	default:  0x0000 \n
	info: \n
		- msb = 15
		- lsb =  0
		- i2c_size =  2

	groups: \n
		['shadow_system_results', 'results']

